package com.ysbzc.day08;
/**
 * 
 * @Description 成员变量
 * @author wyl
 * @date 2020-7-31 16:17:11
 */

/*
 * 成员变量 vs 局部变量
 * 1.相同的
 * 定义格式
 * 先声明后使用
 * 变量都有其对应的作用域
 * 2，不同点
 * 2·1声明的位置不同，
 * 属性直接定义在类的{}中
 *局部变量声明在方法内，方法形参，代码块，构造器形参 
 *2·2权限修饰符不同
 *属性，指明起权限修饰符
 *private public 缺省(不写的默认) protected
 *局部变量，不能使用权限修饰符
 *2·3默认初始化值
 *属性：类的属性，根据其类型，都有默认初始化值
	 *整型
	 *浮点型
	 *字符型
	 *布尔型
	 *引用数据类型
 *局部变量：没有默认初始化值，
 *	一定要显示赋值
 *	特别的，形参在调用时进行赋值
 *2.4在内存中加载的位置也不同
 *属性：加载到对空间
 *局部变量：加载到空间
 *	
 *
 */
public class UserTest {
	
}
